docs/bonk-editing.org
#+title: Bonk-editing
#+OPTIONS: toc:t
#+PROPERTY: header-args:emacs-lisp :tangle ./../core/bonk-editing.el :mkdirp yes

* Provide

#+begin_src emacs-lisp

  (provide 'bonk-editing)

#+end_src

* Org Mode

** Something hacky to stop org-capture from fucking with my windows order
#+begin_src emacs-lisp
  (defun my-org-capture-place-template-dont-delete-windows (oldfun &rest args)
    (cl-letf (((symbol-function 'delete-other-windows) 'ignore))
      (apply oldfun args)))

  (with-eval-after-load "org-capture"
    (advice-add 'org-capture-place-template :around 'my-org-capture-place-template-dont-delete-windows))

  
#+end_src

#+RESULTS:

** Basic configuration
#+begin_src emacs-lisp

  (defun bonk/org-no-line-number ()
	(display-line-numbers-mode 0))

  (setup (:pkg org :straight t)
	(:hook visual-line-mode visual-fill-column-mode org-init-org-directory-h) 
	(:also-load org-tempo)
	(setq org-ellipsis " ▾"
		  org-hide-emphasis-markers t
		  org-src-fontify-natively t
		  org-fontify-quote-and-verse-blocks t
		  org-src-tab-acts-natively t
		  org-edit-src-content-indentation 2
		  org-hide-block-startup nil
		  org-src-preserve-indentation nil
		  org-startup-folded 'content
		  org-cycle-separator-lines 2
		  org-capture-bookmark nil)
	(setq org-refile-targets '((nil :maxlevel . 3)
							   (org-agenda-files :maxlevel . 3)))
	(setq org-outline-path-complete-in-steps nil)

	(setq org-todo-keywords
		  '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
			(sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))
	(setq org-refile-use-outline-path t)
	(org-babel-do-load-languages
	 'org-babel-load-languages
	 '((emacs-lisp . t)
	   ))


	(push '("conf-unix" . conf-unix) org-src-lang-modes))

#+end_src

#+RESULTS:
: ((conf-unix . conf-unix) (conf-unix . conf-unix) (conf-unix . conf-unix) (conf-unix . conf-unix) (conf-unix . conf-unix) (conf-unix . conf-unix) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (desktop . conf-desktop) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql) (toml . conf-toml))

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-org"

#+end_src

** Fonts and Bullets

Use bullet characters instead of asterisks, plus set the header font sizes to something more palatable.  A fair amount of inspiration has been taken from [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][this blog post]].

#+begin_src emacs-lisp

	(setup (:pkg org-superstar :straight t)
	  (:load-after org)
	  (:hook-into org-mode)
	  (:option org-superstar-remove-leading-stars t
			   org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))

  ;; Replace list hyphen with dot
  ;; (font-lock-add-keywords 'org-mode
  ;;                         '(("^ *\\([-]\\) "
  ;;                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  (setup org-faces
	;; Make sure org-indent face is available
	(:also-load org-indent)
	(:when-loaded
	  ;; Increase the size of various headings
	  (set-face-attribute 'org-document-title nil :font "Hack Nerd Font" :weight 'bold :height 1.3)

	  (dolist (face '((org-level-1 . 1.2)
					  (org-level-2 . 1.1)
					  (org-level-3 . 1.05)
					  (org-level-4 . 1.0)
					  (org-level-5 . 1.1)
					  (org-level-6 . 1.1)
					  (org-level-7 . 1.1)
					  (org-level-8 . 1.1)))
		(set-face-attribute (car face) nil :font "Hack Nerd Font" :weight 'medium :height (cdr face)))

	  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
	  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
	  (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
	  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
	  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
	  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
	  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
	  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
	  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
	  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

	  ;; Get rid of the background on column views
	  (set-face-attribute 'org-column nil :background nil)
	  (set-face-attribute 'org-column-title nil :background nil)))

  ;; TODO: Others to consider
  ;; '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
  ;; '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
  ;; '(org-property-value ((t (:inherit fixed-pitch))) t)
  ;; '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
  ;; '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
  ;; '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
  ;; '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))

#+end_src

#+RESULTS:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-org-superstar"

#+end_src

** Block Templates

These templates enable you to type things like =<el= and then hit =Tab= to expand
the template.  More documentation can be found at the Org Mode [[https://orgmode.org/manual/Easy-templates.html][Easy Templates]]
documentation page.

#+begin_src emacs-lisp
  ;; This is needed as of Org 9.2
  (setup org-tempo
  	(:when-loaded
  	  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  	  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  	  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  	  (add-to-list 'org-structure-template-alist '("scm" . "src scheme"))
  	  (add-to-list 'org-structure-template-alist '("li" . "src lisp"))
  	  (add-to-list 'org-structure-template-alist '("rb" . "src ruby"))
  	  (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
  	  (add-to-list 'org-structure-template-alist '("cpp" . "src C++"))
  	  (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
  	  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  	  (add-to-list 'org-structure-template-alist '("go" . "src go"))
  	  (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
  	  (add-to-list 'org-structure-template-alist '("r" . "src R :noweb yes :exports both"))
  	  (add-to-list 'org-structure-template-alist '("json" . "src json"))))


#+end_src

#+RESULTS:
: ((json . src json) (r . src R :noweb yes :exports both) (yaml . src yaml) (go . src go) (ts . src typescript) (cpp . src C++) (js . src javascript) (rb . src ruby) (li . src lisp) (scm . src scheme) (el . src emacs-lisp) (py . src python) (sh . src sh) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

** Org file type insertion
I know i could use org-capture-templates for this, but i don't want to apply
this automatically or in a predefined way. Perhaps there is a more elegant or
comfy way of doing this but well...

#+begin_src emacs-lisp

  (defun prob-buffer (buffer-name)
	"Creates a new probability and statistics buffer for school."
	(interactive "sSet new buffer Name: ")
	(let (($buf (generate-new-buffer buffer-name)))
	  (switch-to-buffer $buf)
	  (insert
	   "#+author:\n#+TITLE:
  ,#+LATEX_HEADER: \\usepackage{unicode-math}
  ,#+LATEX_HEADER: \\usepackage{amsfonts}
  ,#+STARTUP: latexpreview
  ,#+OPTIONS: toc:t
  ,#+LATEX_CLASS: article
  ,#+LATEX_CLASS_OPTIONS: [a5paper, landscape]
  ,#+BABEL: noweb yes
  ,#+PROPERTY: header-args:python :session practica1 :results output
  ,#+PROPERTY: header-args:python+ :async yes :results output")
	  (funcall 'org-mode)
	  (setq buffer-offer-save t)))


#+end_src 

#+RESULTS:
: prob-buffer

** Agenda
#+begin_src emacs-lisp
	  (defun org-init-org-directory-h ()
		(setq org-directory "~/Notes/agenda/")
		(unless org-id-locations-file
		  (setq org-id-locations-file (expand-file-name ".orgids" org-directory))))

	(defun org-init-agenda-h ()
	  (setq org-agenda-files (list org-directory)))
	  (setq
	   ;; Different colors for different priority levels
	   org-agenda-deadline-faces
	   '((1.001 . error)
		 (1.0 . org-warning)
		 (0.5 . org-upcoming-deadline)
		 (0.0 . org-upcoming-distant-deadline))
	   ;; Don't monopolize the whole frame just for the agenda
	   org-agenda-window-setup 'current-window
	   org-agenda-skip-unavailable-files t
	   ;; Shift the agenda to show the previous 3 days and the next 7 days for
	   ;; better context on your week. The past is less important than the future.
	   org-agenda-span 10
	   org-agenda-start-on-weekday nil
	   org-agenda-start-day "-3d"
	   ;; Optimize `org-agenda' by inhibiting extra work while opening agenda
	   ;; buffers in the background. They'll be "restarted" if the user switches to
	   ;; them anyway (see `+org-exclude-agenda-buffers-from-workspace-h')
	   org-agenda-inhibit-startup t)
	(setup (:pkg org-agenda)
	  (:hook org-init-agenda-h)

	  (setq org-agenda-custom-commands
			'(("d" "Dashboard"
			   ((agenda "" ((org-deadline-warning-days 7)))
				(todo "NEXT"
					  ((org-agenda-overriding-header "Next Tasks")))
				(tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	  ("n" "Next Tasks"
	   ((todo "NEXT"
		  ((org-agenda-overriding-header "Next Tasks")))))


	  ("W" "Work Tasks" tags-todo "+work")

	  ;; Low-effort next actions
	  ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
	   ((org-agenda-overriding-header "Low Effort Tasks")
		(org-agenda-max-todos 20)
		(org-agenda-files org-agenda-files)))

	  ("w" "Workflow Status"
	   ((todo "WAIT"
			  ((org-agenda-overriding-header "Waiting on External")
			   (org-agenda-files org-agenda-files)))
		(todo "REVIEW"
			  ((org-agenda-overriding-header "In Review")
			   (org-agenda-files org-agenda-files)))
		(todo "PLAN"
			  ((org-agenda-overriding-header "In Planning")
			   (org-agenda-todo-list-sublevels nil)
			   (org-agenda-files org-agenda-files)))
		(todo "BACKLOG"
			  ((org-agenda-overriding-header "Project Backlog")
			   (org-agenda-todo-list-sublevels nil)
			   (org-agenda-files org-agenda-files)))
		(todo "READY"
			  ((org-agenda-overriding-header "Ready for Work")
			   (org-agenda-files org-agenda-files)))
		(todo "ACTIVE"
			  ((org-agenda-overriding-header "Active Projects")
			   (org-agenda-files org-agenda-files)))
		(todo "COMPLETED"
			  ((org-agenda-overriding-header "Completed Projects")
			   (org-agenda-files org-agenda-files)))
		(todo "CANC"
			  ((org-agenda-overriding-header "Cancelled Projects")
			   (org-agenda-files org-agenda-files)))))))
	  )
  
  (define-key global-map (kbd "C-c j")
	(lambda () (interactive) (org-capture nil "j")))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (org-capture nil j) |
