core/bonk-editing.el
(provide 'bonk-editing)

(defun bonk/org-no-line-number ()
	  (display-line-numbers-mode 0))

(setup (:pkg org :straight t)
  (:hook visual-line-mode visual-fill-column-mode)
	  (:also-load org-tempo)
	 (setq org-ellipsis " ▾"
		   org-hide-emphasis-markers t
		   org-src-fontify-natively t
		   org-fontify-quote-and-verse-blocks t
		   org-src-tab-acts-natively t
		   org-edit-src-content-indentation 2
		   org-hide-block-startup nil
		   org-src-preserve-indentation nil
		   org-startup-folded 'content
		   org-cycle-separator-lines 2
		   org-capture-bookmark nil)
	(setq org-refile-targets '((nil :maxlevel . 1)
							   (org-agenda-files :maxlevel . 1)))
	(setq org-outline-path-complete-in-steps nil)
	(setq org-refile-use-outline-path t)
	(org-babel-do-load-languages
	  'org-babel-load-languages
	  '((emacs-lisp . t)
		))


	(push '("conf-unix" . conf-unix) org-src-lang-modes))

(setup (:pkg org-superstar :straight t)
	(:load-after org)
	(:hook-into org-mode)
	(:option org-superstar-remove-leading-stars t
			 org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))

;; Replace list hyphen with dot
;; (font-lock-add-keywords 'org-mode
;;                         '(("^ *\\([-]\\) "
;;                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

(setup org-faces
  ;; Make sure org-indent face is available
  (:also-load org-indent)
  (:when-loaded
	;; Increase the size of various headings
	(set-face-attribute 'org-document-title nil :font "Hack Nerd Font" :weight 'bold :height 1.3)

	(dolist (face '((org-level-1 . 1.2)
					(org-level-2 . 1.1)
					(org-level-3 . 1.05)
					(org-level-4 . 1.0)
					(org-level-5 . 1.1)
					(org-level-6 . 1.1)
					(org-level-7 . 1.1)
					(org-level-8 . 1.1)))
	  (set-face-attribute (car face) nil :font "Hack Nerd Font" :weight 'medium :height (cdr face)))

	;; Ensure that anything that should be fixed-pitch in Org files appears that way
	(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
	(set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
	(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
	(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
	(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
	(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
	(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
	(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
	(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

	;; Get rid of the background on column views
	(set-face-attribute 'org-column nil :background nil)
	(set-face-attribute 'org-column-title nil :background nil)))

;; TODO: Others to consider
;; '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
;; '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
;; '(org-property-value ((t (:inherit fixed-pitch))) t)
;; '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
;; '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
;; '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
;; '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))

;; This is needed as of Org 9.2
(setup org-tempo
   (:when-loaded
	 (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
	 (add-to-list 'org-structure-template-alist '("py" . "src python"))
	 (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
	 (add-to-list 'org-structure-template-alist '("scm" . "src scheme"))
	 (add-to-list 'org-structure-template-alist '("li" . "src lisp"))
	 (add-to-list 'org-structure-template-alist '("rb" . "src ruby"))
	 (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
	 (add-to-list 'org-structure-template-alist '("cpp" . "src C++"))
	 (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
	 (add-to-list 'org-structure-template-alist '("py" . "src python"))
	 (add-to-list 'org-structure-template-alist '("go" . "src go"))
	 (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
	 (add-to-list 'org-structure-template-alist '("r" . "src R :noweb yes :exports both"))
	 (add-to-list 'org-structure-template-alist '("json" . "src json"))))

(defun prob-buffer (buffer-name)
  "Creates a new probability and statistics buffer for school."
  (interactive "sSet new buffer Name: ")
  (let (($buf (generate-new-buffer buffer-name)))
	(switch-to-buffer $buf)
	(insert
	 "#+author:\n#+TITLE:
#+LATEX_HEADER: \\usepackage{unicode-math}
#+LATEX_HEADER: \\usepackage{amsfonts}
#+STARTUP: latexpreview
#+OPTIONS: toc:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a5paper, landscape]
#+BABEL: noweb yes
#+PROPERTY: header-args:python :session practica1 :results output
#+PROPERTY: header-args:python+ :async yes :results output")
	(funcall 'org-mode)
	(setq buffer-offer-save t)))
