docs/bonk-editing.org
** Capture Templates
#+begin_src emacs-lisp

    (setq org-capture-templates
      `(("t" "Tasks / Projects")
        ("tt" "Task" entry (file "Tasks.org")
             "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
          ("o" "Centralized templates for projects")
          ("ot" "Project todo" entry
           (file "Projects_todo.org")
           "* TODO %?\n %i\n %a"
           :heading "Tasks"
           :prepend nil)
          ("on" "Project notes" entry
           (file+headline "Projects_notes.org" "Project Notes")
           "* %U %?\n %i\n %a"
           :heading "Notes"
           :prepend t)
          ("oc" "Project changelog" entry
           (file "Project_Changelog.org")
           "* %U %?\n %i\n %a"
           :heading "Changelog"
           :prepend t)

        ("j" "Journal Entries")
        ("jj" "Journal" entry
             (file+olp+datetree "Journal.org")
             "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
             ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
             :clock-in :clock-resume
             :empty-lines 1)
        ("jm" "Meeting" entry
             (file+olp+datetree "Journal.org")
             "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)

        ("w" "Workflows")
        ("we" "Checking Email" entry (file+olp+datetree "Wokr.org")
             "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

        ("m" "Metrics Capture")
        ("mw" "Weight" table-line (file+headline "Metrics.org" "Weight")
         "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))
#+end_src

#+RESULTS:
| t  | Tasks / Projects |       |                  |           |
| tt | Task             | entry | (file Tasks.org) | * TODO %? |

** Pomodoro

#+begin_src emacs-lisp

  (setup (:pkg org-pomodoro :straight t)

    (bonk/set-leader-keys
      "op"  '(org-pomodoro :which-key "pomodoro")))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-org-pomodoro"

#+end_src

** Protocol

This is probably not needed if I plan to use custom functions that are invoked
through =emacsclient.=

#+begin_src emacs-lisp

  (require 'org-protocol)

#+end_src

#+RESULTS:
: org-protocol

** Center Org Buffers
#+begin_src emacs-lisp

  (defun bonk/org-mode-visual-fill ()
	  (setq visual-fill-column-center-text t)
	  (setq visual-fill-column-width 100)
	  (visual-fill-column-mode 1))

  (setup (:pkg visual-fill-column :straight t)
	(:hook-into org)
	(bonk/org-mode-visual-fill))

#+end_src

#+RESULTS:
: t

** Bindings

#+begin_src emacs-lisp

  (setup (:pkg evil-org :straight t)
	(:hook-into org-mode org-agenda-mode)
	(require 'evil-org)
	(require 'evil-org-agenda)
	(evil-org-set-key-theme '(navigation todo insert textobjects additional))
	(evil-org-agenda-set-keys))

  (bonk/set-leader-keys
	"o"   '(:ignore t :which-key "org mode")

	"oi"  '(:ignore t :which-key "insert")
	"oil" '(org-insert-link :which-key "insert link")

	"on"  '(org-toggle-narrow-to-subtree :which-key "toggle narrow")

	"olp" '(org-latex-preview :which-key "preview latex block")
	"oki" '(org-krita-insert-new-image :which-key "insert new krita image")
	
	"oa"  '(org-agenda :which-key "status")
	"ot"  '(org-todo-list :which-key "todos")
	"oc"  '(org-capture t :which-key "capture")
	"ox"  '(org-export-dispatch t :which-key "export"))

#+end_src

#+RESULTS:

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-evil-org"

#+end_src

** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp
	  (setup (:pkg ob-rust :straight t))
	  (setup (:pkg ob-go :straight t))
	  (setup (:pkg ob-typescript :straight t))
	  (setup (:pkg ob-ipython :straight t))
  (setup (:pkg ob-sagemath :straight t))
  (setup (:pkg jupyter :straight t))
	  (with-eval-after-load 'org
		(org-babel-do-load-languages
		  'org-babel-load-languages
		  '((emacs-lisp . t)
			(python . t)
			(R . t)
			(typescript . t)
			(go . t)
			(scheme . t)
			(rust . t)
			(lisp . t)))
		(setq org-confirm-babel-evaluate nil)
		(setq org-babel-lisp-eval-fn #'sly-eval)

		(push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

#+RESULTS:
: ((conf-unix . conf-unix) (conf-unix . conf-unix) (conf-unix . conf-unix) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (desktop . conf-desktop) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql) (toml . conf-toml))

** Org Present
=org-present=
#+begin_src emacs-lisp
  (defun bonk/org-present-prepare-slide ()
    (org-overview)
    (org-show-entry)
    (org-show-children))

  (defun bonk/org-present-hook ()
    (setq header-line-format " ")
    (org-appear-mode -1)
    (org-display-inline-images)
    (bonk/org-present-prepare-slide))

  (defun bonk/org-present-quit-hook ()
    (setq header-line-format nil)
    (org-present-small)
    (org-remove-inline-images)
    (org-appear-mode 1))

  (defun bonk/org-present-prev ()
    (interactive)
    (org-present-prev)
    (bonk/org-present-prepare-slide))

  (defun bonk/org-present-next ()
    (interactive)
    (org-present-next)
    (bonk/org-present-prepare-slide)
    (when (fboundp 'live-crafter-add-timestamp)
      (live-crafter-add-timestamp (substring-no-properties (org-get-heading t t t t)))))

  (setup (:pkg org-present)
    (:with-map org-present-mode-keymap
      (:bind "C-c C-j" bonk/org-present-next
             "C-c C-k" bonk/org-present-prev))
    (:hook bonk/org-present-hook)
    (:with-hook org-present-mode-quit-hook
      (:hook bonk/org-present-quit-hook)))
#+end_src 

#+RESULTS:
| bonk/org-present-quit-hook |

** Org-tikz (graphs and stuff preview)
#+begin_src emacs-lisp
    (setup (:pkg texfrag :straight t))
    (add-hook 'org-mode-hook
      (lambda ()
        (texfrag-mode)
      ))

    (add-to-list 'org-latex-packages-alist
                 '("" "tikz" t))
    (eval-after-load "preview"
      '(add-to-list 'preview-default-preamble "\\PreviewEnvironment{tikzpicture}" t))
#+end_src

#+RESULTS:

*** Keymaps

| Value    | function                        |
| -------- | ------------------------------  |
| <left>   | org-present-prev                |
| <right>  | org-present-next                |
| C-c   <   | org-present-beginning           |
| C-c   >   | org-present-end                 |
| C-c   C-- | org-present-small               |
| C-c   C-1 | org-present-toggle-one-big-page |
| C-c   C-= | org-present-big                 |
| C-c   C-q | org-present-quit                |
| C-c   C-r | org-present-read-only           |
| C-c   C-w | org-present-read-write          |

** TODO Update Table of Contents on Save

It's nice to have a table of contents section for long literate configuration files (like this one!) so I use =org-make-toc= to automatically update the ToC in any header with a property named =TOC=.

#+begin_src emacs-lisp

  (setup (:pkg org-make-toc :straight t)
    (:hook-into org-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-org-make-toc"

#+end_src

* Buffer-alist
#+begin_src emacs-lisp

  (setopt
   display-buffer-base-action
   '((display-buffer-reuse-window display-buffer-same-window
      display-buffer-in-previous-window
      display-buffer-use-some-window)))
  (setopt
   display-buffer-alist
   (cons '("*Org*" (display-buffer-same-window))
          display-buffer-alist))
   
    (add-to-list 'display-buffer-alist
                 '("\\*org-roam\\*"
    					(inhibit-switch-frame . t)
  (
                   (window-width . 0.33)
                   (window-parameters . ((no-other-window . t)
                                         (no-delete-other-windows . t))))))
#+end_src

#+RESULTS:
| \*org-roam\*   | (inhibit-switch-frame . t)   | ((window-width . 0.33) (window-parameters (no-other-window . t) (no-delete-other-windows . t))) |                                                                         |                                                                         |                       |                                                                         |
| *Org*            | (display-buffer-same-window) |                                                                                                 |                                                                         |                                                                         |                       |                                                                         |
| *Org*            | (display-buffer-same-window) |                                                                                                 |                                                                         |                                                                         |                       |                                                                         |
| \*org\*        | (display-buffer-same-window) | (inhibit-switch-frame . t)                                                                      | (window-parameters (no-other-window . t) (no-delete-other-windows . t)) |                                                                         |                       |                                                                         |
| \*org-roam\*   | (display-buffer-same-window) | (inhibit-switch-frame . t)                                                                      | (window-width . 0.33)                                                   | (window-parameters (no-other-window . t) (no-delete-other-windows . t)) |                       |                                                                         |
| \*Org\*        | (display-buffer-same-window) |                                                                                                 |                                                                         |                                                                         |                       |                                                                         |
| \*org\*        | (display-buffer-same-window) |                                                                                                 |                                                                         |                                                                         |                       |                                                                         |
| \*Org\*        | (display-buffer-same-window) | (side . left)                                                                                   | (slot . 0)                                                              | (inhibit-switch-frame . t)                                              | (window-width . 0.33) | (window-parameters (no-delete-other-windows . t))                       |
| \*Org\*        | (display-buffer-same-window) | (side . left)                                                                                   | (slot . 0)                                                              | (inhibit-switch-frame . t)                                              | (window-width . 0.33) | (window-parameters (no-other-window . t) (no-delete-other-windows . t)) |
| \*.pdf\*       | (window-width . 0.33)        | (dedicated . side)                                                                              | (side . left)                                                           | (window-parameters (no-other-window . t) (no-delete-other-windows . t)) |                       |                                                                         |
| \*Org Select\* | (display-buffer-same-window) | (side . left)                                                                                   | (slot . 0)                                                              | (inhibit-switch-frame . t)                                              | (window-width . 0.33) | (window-parameters (no-other-window . t) (no-delete-other-windows . t)) |
| \*org-roam\*   | (display-buffer-same-window) | (side . left)                                                                                   | (slot . 0)                                                              | (inhibit-switch-frame . t)                                              | (window-width . 0.33) | (window-parameters (no-other-window . t) (no-delete-other-windows . t)) |

