core/bonk-editing.el

(setup (:pkg org-pomodoro :straight t)

  (bonk/leader-keys
    "op"  '(org-pomodoro :which-key "pomodoro")))

(require 'org-protocol)

(defun bonk/org-mode-visual-fill ()
	(setq visual-fill-column-center-text t)
	(setq visual-fill-column-width 100)
	(visual-fill-column-mode 1))

(setup (:pkg visual-fill-column)
  (:hook-into org)
  (bonk/org-mode-visual-fill))

(setup (:pkg evil-org :straight t)
  (:hook-into org-mode org-agenda-mode)
  (require 'evil-org)
  (require 'evil-org-agenda)
  (evil-org-set-key-theme '(navigation todo insert textobjects additional))
  (evil-org-agenda-set-keys))

(bonk/leader-keys
  "o"   '(:ignore t :which-key "org mode")

  "oi"  '(:ignore t :which-key "insert")
  "oil" '(org-insert-link :which-key "insert link")

  "on"  '(org-toggle-narrow-to-subtree :which-key "toggle narrow")

  "olp" '(org-latex-preview :which-key "preview latex block")

  "oa"  '(org-agenda :which-key "status")
  "ot"  '(org-todo-list :which-key "todos")
  "oc"  '(org-capture t :which-key "capture")
  "ox"  '(org-export-dispatch t :which-key "export"))

(setup (:pkg ob-rust :straight t))
	(setup (:pkg ob-go :straight t))
	(setup (:pkg ob-typescript :straight t))
	(setup (:pkg ob-ipython :straight t))
(setup (:pkg ob-sagemath :straight t))
(setup (:pkg jupyter :straight t))
	(with-eval-after-load 'org
	  (org-babel-do-load-languages
		'org-babel-load-languages
		'((emacs-lisp . t)
		  (python . t)
		  (R . t)
		  (typescript . t)
		  (go . t)
		  (scheme . t)
		  (rust . t)
		  (lisp . t)))
	  (setq org-confirm-babel-evaluate nil)
	  (setq org-babel-lisp-eval-fn #'sly-eval)

	  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(defun bonk/org-present-prepare-slide ()
  (org-overview)
  (org-show-entry)
  (org-show-children))

(defun bonk/org-present-hook ()
  (setq header-line-format " ")
  (org-appear-mode -1)
  (org-display-inline-images)
  (bonk/org-present-prepare-slide))

(defun bonk/org-present-quit-hook ()
  (setq header-line-format nil)
  (org-present-small)
  (org-remove-inline-images)
  (org-appear-mode 1))

(defun bonk/org-present-prev ()
  (interactive)
  (org-present-prev)
  (bonk/org-present-prepare-slide))

(defun bonk/org-present-next ()
  (interactive)
  (org-present-next)
  (bonk/org-present-prepare-slide)
  (when (fboundp 'live-crafter-add-timestamp)
    (live-crafter-add-timestamp (substring-no-properties (org-get-heading t t t t)))))

(setup (:pkg org-present)
  (:with-map org-present-mode-keymap
    (:bind "C-c C-j" bonk/org-present-next
           "C-c C-k" bonk/org-present-prev))
  (:hook bonk/org-present-hook)
  (:with-hook org-present-mode-quit-hook
    (:hook bonk/org-present-quit-hook)))

(setup (:pkg org-make-toc :straight t)
  (:hook-into org-mode))
