docs/bonk-editing.org
* Org-Roam
:LOGBOOK:
CLOCK: [2023-08-27 Sun 05:40]--[2023-08-27 Sun 05:46] =>  0:06
:END:

#+begin_src emacs-lisp
  (setup (:pkg org-roam :straight t)
    (setq org-roam-v2-ack t)
    (:when-loaded
  	(org-roam-db-autosync-mode))
    (:option
     org-roam-directory "~/Notes/Roam/"
     org-roam-completion-everywhere t
     org-roam-capture-templates
     '(("d" "default" plain "%?"
  	  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
  						 "#+title: ${title}\n")
  	  :unnarrowed t)
  	 ("l" "learn org roam" plain
  	  "* Category\n- Class: [[roam:roam]] \n- Topic: %?"
  	  :if-new (file+head "learn_org_roam/${title}.org"
  						 "#+title: ${title}\n#+filetags: org roam learning")
  	  :unnarrowed t)
  	 ("p" "programming note" plain
  	  "* Category\n- Class: [[programming]] \n- Topic: %?\n- Language: "
  	  :if-new (file+head "programming/${title}.org"
  						 "#+title: ${title}\n#+filetags: org roam programming")
  	  :unnarrowed t)
  	 ("g" "programming note with graphics" plain
  	  "* Category\n- Class: [[programming]] \n- Topic: %?\n- Language: \n** Latex Imports\n#+LATEX_HEADER: \\usepackage{tikz}\n#+LATEX_HEADER: \\usepackage{svg}\n#+HEADER: :imagemagick yes\n#+HEADER: :exports results\n#+HEADER: :results output graphics file"
  	  :if-new (file+head "programming/${title}.org"
  						 "#+title: ${title}\n#+filetags: org roam programming graphics")
  	  :unnarrowed t)
  	 ("m" "math_esp" plain
  	  "* Category\n- Class: [[roam:math]] \n- Topic: %?"
  	  :if-new (file+head "math_esp/${title}.org"
  						 "#+title: ${title}\n#+filetags: math esp")
  	  :unnarrowed t)
  	 ("D" "math_esp definition" plain
  	  "* Category\n- Class: [[roam:math]] \n- Topic: %? \n* Definicion"
  	  :if-new (file+head "math_esp/definitions/${title}.org"
  						 "#+title: ${title}\n#+filetags: math esp definitions")
  	  :unnarrowed t)
  	 ("E" "math_esp example" plain
  	  "* Category\n- Class: [[roam:math]] \n- Topic: %? \n* Ejemplos"
  	  :if-new (file+head "math_esp/examples/${title}.org"
  						 "#+title: ${title}\n#+filetags: math esp examples")
  	  :unnarrowed t)
  	 ("P" "math_esp properties" plain
  	  "* Category\n- Class: [[roam:math]] \n- Topic: %? \n* Propiedades"
  	  :if-new (file+head "math_esp/properties/${title}.org"
  						 "#+title: ${title}\n#+filetags: math esp propiedades")
  	  :unnarrowed t)))
    (:global "C-c n l"   org-roam-buffer-toggle
  		   "C-c n f"   org-roam-node-find
  		   "C-c n c"   org-roam-dailies-capture-today
  		   "C-c n g"   org-roam-graph
  		   "C-c n i"  org-roam-node-insert))
  (setup (:pkg org-roam-ui :straight t))

#+end_src

#+RESULTS:
: t



* Org-xournal and krita
This is mainly to integrate a wacom tablet with org-mode
#+begin_src emacs-lisp
  (setup (:pkg org-krita :straight t
         	 :type git
  			 :host github
  			 :repo "lepisma/org-krita"
  			 :files ("*.el" "resources") )
    (:hook-into org-mode)
    )

  (setup (:pkg org-xournalpp :straight t
         	 :type git
  			 :host gitlab
  			 :repo "vherrmann/org-xournalpp"
  			 :files ("*.el" "resources") )
    (:hook-into org-mode)
    )
#+end_src

#+RESULTS:
| org-xournalpp-mode | org-krita-mode | (lambda nil (texfrag-mode)) | rainbow-delimiters-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-make-toc-mode | evil-org-mode | org-superstar-mode | org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-init-org-directory-h | visual-fill-column-mode | visual-line-mode |
