core/bonk-editing.el

(setup (:pkg org-roam :straight t)
  (setq org-roam-v2-ack t)
  (:when-loaded
	(org-roam-db-autosync-mode))
  (:option
   org-roam-directory "~/Notes/Roam/"
   org-roam-completion-everywhere t
   org-roam-capture-templates
   '(("d" "default" plain "%?"
	  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
						 "#+title: ${title}\n")
	  :unnarrowed t)
	 ("l" "learn org roam" plain
	  "* Category\n- Class: [[roam:roam]] \n- Topic: %?"
	  :if-new (file+head "learn_org_roam/${title}.org"
						 "#+title: ${title}\n#+filetags: org roam learning")
	  :unnarrowed t)
	 ("p" "programming note" plain
	  "* Category\n- Class: [[programming]] \n- Topic: %?\n- Language: "
	  :if-new (file+head "programming/${title}.org"
						 "#+title: ${title}\n#+filetags: org roam programming")
	  :unnarrowed t)
	 ("m" "math_esp" plain
	  "* Category\n- Class: [[roam:math]] \n- Topic: %?"
	  :if-new (file+head "math_esp/${title}.org"
						 "#+title: ${title}\n#+filetags: math esp")
	  :unnarrowed t)
	 ("D" "math_esp definition" plain
	  "* Category\n- Class: [[roam:math]] \n- Topic: %? \n* Definicion"
	  :if-new (file+head "math_esp/definitions/${title}.org"
						 "#+title: ${title}\n#+filetags: math esp definitions")
	  :unnarrowed t)
	 ("E" "math_esp example" plain
	  "* Category\n- Class: [[roam:math]] \n- Topic: %? \n* Ejemplos"
	  :if-new (file+head "math_esp/examples/${title}.org"
						 "#+title: ${title}\n#+filetags: math esp examples")
	  :unnarrowed t)
	 ("P" "math_esp properties" plain
	  "* Category\n- Class: [[roam:math]] \n- Topic: %? \n* Propiedades"
	  :if-new (file+head "math_esp/properties/${title}.org"
						 "#+title: ${title}\n#+filetags: math esp propiedades")
	  :unnarrowed t)))
  (:global "C-c n l"   org-roam-buffer-toggle
		   "C-c n f"   org-roam-node-find
		   "C-c n c"   org-roam-dailies-capture-today
		   "C-c n g"   org-roam-graph
		   "C-c n i"  org-roam-node-insert))
(setup (:pkg org-roam-ui :straight t))
